1. Install pandas

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\valarr\appdata\local\programs\python\python311\lib\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.23.2 in c:\users\valarr\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\valarr\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\valarr\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\valarr\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\valarr\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

2. Check Pandas installation and print its version

In [3]:
import pandas as pd
print(pd.__version__)

2.3.1

3. Create series from the list

In [5]:
temperatures=[22,25,21,19,23]
temp_series=pd.Series(temperatures)
print(temp_series)

0    22
1    25
2    21
3    19
4    23
dtype: int64

4. create series with custom index

In [8]:
sales=[150,200,95]
days=['Monday','Tuesday','Wednesday']
daily_sales=pd.Series(sales,index=days)
print(daily_sales)

Monday       150
Tuesday      200
Wednesday     95
dtype: int64

5. creating dataframe from dictionary

In [11]:
employee_data={
    'Name':['Valarr','Siva','Yuvashri','Arjun'],
    'Age':[29,28,26,28],
    'Department':['HR', 'Engineering', 'Marketing', 'Engineering'],
    'Salary':[70000, 95000, 58000, 110000]
}
df=pd.DataFrame(employee_data)
print(df)

       Name  Age   Department  Salary
0    Valarr   29           HR   70000
1      Siva   28  Engineering   95000
2  Yuvashri   26    Marketing   58000
3     Arjun   28  Engineering  110000

6. To see top rows

In [13]:
df.head()
# By default it displays first 5 rows

       Name  Age   Department  Salary
0    Valarr   29           HR   70000
1      Siva   28  Engineering   95000
2  Yuvashri   26    Marketing   58000
3     Arjun   28  Engineering  110000

In [14]:
df.head(2)

     Name  Age   Department  Salary
0  Valarr   29           HR   70000
1    Siva   28  Engineering   95000

In [16]:
print(df.head(2))

     Name  Age   Department  Salary
0  Valarr   29           HR   70000
1    Siva   28  Engineering   95000

7. To check dimension

In [18]:
print(df.shape)

(4, 4)

In [19]:
df.shape

(4, 4)

8. To get technical summary

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        4 non-null      object
 1   Age         4 non-null      int64
 2   Department  4 non-null      object
 3   Salary      4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes